---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionForbiddenElementInGroup
source: html/4fc95c75-9fda-a4ab-0495-c118120ea3fd.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StructuralConnectionFailures.StructuralConnectionForbiddenElementInGroup Property

Fabrication element can not be a group member.

## Syntax (C#)
```csharp
public static FailureDefinitionId StructuralConnectionForbiddenElementInGroup { get; }
```